Revit 2027 API
ExportPatternTable.GetKeys Method
 Gets all the keys stored in the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ExportPatternKey> GetKeys()
Public Function GetKeys As IList(Of ExportPatternKey)
public:
IList<ExportPatternKey^>^ GetKeys()
member GetKeys : unit -> IList<ExportPatternKey>
Return Value
IList<ExportPatternKey>
 Return the key array.
See Also
Reference
ExportPatternTable Class
Autodesk.Revit.DB Namespace